% 9.6节：蠓虫程序（加注释）
clc; clear all;
% 原始数据散点图
Apf=[1.14,1.78;1.18,1.96;1.20,1.86;1.26,2.00;1.28,2.00;1.30,1.96];   %Apf蠓虫数据
Af=[1.24,1.72; ;1.36, 1.74; 1.38,1.64;1.38, 1.90; 1.40, 1.70; 1.48, 1.82;1.38,1.82;1.54,1.82; 1.56, 2.08];    %Af蠓虫数据
x=[1.24,1.80;1.29,1.81;1.43,2.03];    %待判蠓虫数据
figure(1);   %画原始数据散点图1
plot(Apf(:,1),Apf(:,2),'*',Af(:,1),Af(:,2),'or',x(:,1),x(:,2),'p')    
xlabel('触角长')
ylabel('翅长')
legend('Apf','Af','x','Location','southeast')   

% Box M检验
Apf=[1.14,1.78;1.18,1.96;1.20,1.86;1.26,2.00;1.28,2.00;1.30,1.96];
Af=[1.24,1.72; ;1.36, 1.74; 1.38,1.64;1.38, 1.90; 1.40, 1.70; 1.48, 1.82;1.38,1.82;1.54,1.82; 1.56, 2.08];
n1=size(Apf,1)   %Apf蠓虫样本容量
n2=size(Af,1)    %Af蠓虫样本容量
p=2
f=p*(p+1)/2     %统计量自由度
s1=cov(Apf)     %Apf蠓虫协方差矩阵
s2=cov(Af)      %Af蠓虫协方差矩阵
s=((n1-1)*s1+(n2-1)*s2)/(n1+n2-2) %混合协方差矩阵
c=(2*p^2+3*p-1)/(6*(p+1))*(1/(n1-1)+1/(n2-1)-1/(n1+n2-2))
M=(n1+n2-2)*log(det(s))-(n1-1)*log(det(s1))-(n2-1)*log(det(s2)) %计算检验中的M值
M0=(1-c)*M
p0=1-chi2cdf(M0,f)  %卡方分布概率（p值）


%距离判别
Apf=[1.14,1.78;1.18,1.96;1.20,1.86;1.26,2.00;1.28,2.00;1.30,1.96];
Af=[1.24,1.72; ;1.36, 1.74; 1.38,1.64;1.38, 1.90; 1.40, 1.70; 1.48, 1.82;1.38,1.82;1.54,1.82; 1.56, 2.08];
x=[1.24,1.80;1.29,1.81;1.43,2.03];    %输入原始数据
n1=size(Apf,1)
n2=size(Af,1)  %样本容量
m1=mean(Apf)
m2=mean(Af)   %计算均值向量
s1=cov(Apf)
s2=cov(Af)   %计算协方差矩阵
s=((n1-1)*s1+(n2-1)*s2)/(n1+n2-2)  %计算混合样本协方差矩阵
a=(m1-m2)*inv(s)  %计算判别函数的系数
wc=-1/2*(m1+m2)*a'   %计算判别函数的常数项
for i=1:3
W(i)=(x(i,:)-1/2*(m1+m2))*inv(s)*(m1-m2)';  %计算判别函数值
end
figure(2);
plot(Apf(:,1),Apf(:,2),'*',Af(:,1),Af(:,2),'or',x(:,1),x(:,2),'p')
hold on
ezplot(@(x1,x2)(-58.2364*x1+38.0587*x2+5.8715),[1.1,1.6],[1.5,2.3])
legend('Apf','Af','x','Location','southeast')
hold off    %画图2

%回代误判率
Apf=[1.14,1.78;1.18,1.96;1.20,1.86;1.26,2.00;1.28,2.00;1.30,1.96];
Af=[1.24,1.72; ;1.36, 1.74; 1.38,1.64;1.38, 1.90; 1.40, 1.70; 1.48, 1.82;1.38,1.82;1.54,1.82; 1.56, 2.08];    %输入原始数据
n1=size(Apf,1) ;
n2=size(Af,1) ;      %样本容量
s1=cov(Apf)
s2=cov(Af)   %计算协方差矩阵
s=((n1-1)*s1+(n2-1)*s2)/(n1+n2-2)  %计算混合样本协方差矩阵
for i=1:n1
d1(i)=(Apf(i,:)-mean(Apf))*inv(s)*(Apf(i,:)-mean(Apf))'-(Apf(i,:)-mean(Af))*inv(s)*(Apf(i,:)-mean(Af))';        
end     %Apf样品到两总体的距离平方差
for i=1:n2
d2(i)=(Af(i,:)-mean(Af))*inv(s)*(Af(i,:)-mean(Af))'-(Af(i,:)-mean(Apf))*inv(s)*(Af(i,:)-mean(Apf))';
end    %Af样品到两总体的距离平方差
n12=length(find(d1>0))     %Apf回代误判的样品个数
n21=length(find(d2>0))     %Af回代误判的样品个数
p1=(n12+n21)/(n1+n2)      %回代误判率

%交叉验证误判率
Apf=[1.14,1.78;1.18,1.96;1.20,1.86;1.26,2.00;1.28,2.00;1.30,1.96];
Af=[1.24,1.72; ;1.36, 1.74; 1.38,1.64;1.38, 1.90; 1.40, 1.70; 1.48, 1.82;1.38,1.82;1.54,1.82; 1.56, 2.08];
for i=1:n1
Apf1=Apf([1:i-1,i+1:n1],:);   %剔除第i个Apf样品并进行判别
n1=length(Apf1(:,1));
n2=length(Af(:,1));
s1=cov(Apf1);
s2=cov(Af);
s=((n1-1)*s1+(n2-1)*s2)/(n1+n2-2);
D1(i)=(Apf(i,:)-mean(Apf1))*inv(s)*(Apf(i,:)-mean(Apf1))'-(Apf(i,:)-mean(Af))*inv(s)*(Apf(i,:)-mean(Af))';
end  
for i=1:n2
Af1=Af([1:i-1,i+1:n2],:);
n1=length(Apf(:,1));
n2=length(Af1(:,1));
s1=cov(Apf1);
s2=cov(Af1);
s=((n1-1)*s1+(n2-1)*s2)/(n1+n2-2);
D2(i)=(Af(i,:)-mean(Af1))*inv(s)*(Af(i,:)-mean(Af1))'-(Af(i,:)-mean(Apf))*inv(s)*(Af(i,:)-mean(Apf))';
end   %剔除第i个Apf样品并进行判别
N1=length(find(D1>0))   %Apf交叉误判的样品个数
N2=length(find(D2>0))   %Af交叉误判的样品个数
p2=(N1+N2)/(n1+n2)    %交叉误判率

 
% 表3结果
Apf=[1.14,1.78;1.18,1.96;1.20,1.86;1.26,2.00;1.28,2.00;1.30,1.96];
Af=[1.24,1.72; ;1.36, 1.74; 1.38,1.64;1.38, 1.90; 1.40, 1.70; 1.48, 1.82;1.38,1.82;1.54,1.82; 1.56, 2.08];
x=[1.24,1.80;1.29,1.81;1.43,2.03];    %输入原始数据
n1=size(Apf,1)
n2=size(Af,1)  %样本容量
m1=mean(Apf)
m2=mean(Af)   %计算均值向量
s1=cov(Apf)
s2=cov(Af)   %计算协方差矩阵
s=((n1-1)*s1+(n2-1)*s2)/(n1+n2-2)  %计算混合样本协方差矩阵
a=1.5  %取损失比Alpha=1.5
for i=1:3
Wb(i)=(x(i,:)-1/2*(m1+m2))*inv(s)*(m1-m2)'-log(1.5/a);  %计算判别函数值减去阈值
end
